#include <bits/stdc++.h>
using namespace std;

int main() {
    int a_int = 1;
    const int A_int = a_int;
    const signed int Max_sint = 32767;

    char a_char = 'a';
    char b_char = 1;
    const signed char Max_schar = 127;

    long a_long = 123456;
    const signed long Max_slong = 2147483647;

    long long a_long_long = 1;

    float a_float = 1.41421356;

    double a_double = 3.1415926535897932384626433832795;

    int a_aint[A_int] = {};

    string a_str = "abc";
    string b_str = "あいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこあいうえおかきくけこ";


    long double a_ulong_double = 1;
    unsigned long long int a_ulong_long = 1;
    // cin >> a_int;
    a_long = Max_slong*(-1) -1;
    cout << a_long << endl;





}